In [1]:
import numpy as np
import pandas as pd

###  giving our own index

In [2]:
a=pd.Series([10,2,3],index=[2,4,8])
a

2    10
4     2
8     3
dtype: int64

In [15]:
a=pd.Series([1,2,3])
a

0    1
1    2
2    3
dtype: int64

### data frame using dictionary

In [16]:
a=pd.Series({"a":10,"b":20,"c":30})
a

a    10
b    20
c    30
dtype: int64

### linspacing

In [18]:
=pd.Series(np.linspace(10,20,4))
a

0    10.000000
1    13.333333
2    16.666667
3    20.000000
dtype: float64

In [19]:
a=pd.Series([[1,23,2],[4,7,8],[3,8,9]])
a

0    [1, 23, 2]
1     [4, 7, 8]
2     [3, 8, 9]
dtype: object

In [20]:
for i in a:
    for j in a:
        if i==j:
            print(a)

0    [1, 23, 2]
1     [4, 7, 8]
2     [3, 8, 9]
dtype: object
0    [1, 23, 2]
1     [4, 7, 8]
2     [3, 8, 9]
dtype: object
0    [1, 23, 2]
1     [4, 7, 8]
2     [3, 8, 9]
dtype: object

In [24]:
a=pd.read_csv("Salary_Data.csv")
a

    YearsExperience    Salary
0               1.1   39343.0
1               1.3   46205.0
2               1.5   37731.0
3               2.0   43525.0
4               2.2   39891.0
5               2.9   56642.0
6               3.0   60150.0
7               3.2   54445.0
8               3.2   64445.0
9               3.7   57189.0
10              3.9   63218.0
11              4.0   55794.0
12              4.0   56957.0
13              4.1   57081.0
14              4.5   61111.0
15              4.9   67938.0
16              5.1   66029.0
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

### getting the specified rows and columns

In [28]:
a.iloc[[0,7]][["Salary"]]

    Salary
0  39343.0
7  54445.0

In [29]:
a["Salary"].min()

37731.0

In [30]:
a["Salary"].max()

122391.0

In [32]:
a["Salary"].std()

27414.4297845823

In [33]:
a["Salary"].mean()

76003.0

In [35]:
b=a["Salary"]<3000
b

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
Name: Salary, dtype: bool

In [36]:
a.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [37]:
a.tail()

    YearsExperience    Salary
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [38]:
a.head().tail(2)

   YearsExperience   Salary
3              2.0  43525.0
4              2.2  39891.0

In [45]:
b=a[a["Salary"]<40000]
b

   YearsExperience   Salary
0              1.1  39343.0
2              1.5  37731.0
4              2.2  39891.0

In [44]:
b=a[a["Salary"]>70000]
b

    YearsExperience    Salary
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [48]:
b=a[(a["Salary"]<40000)|(a["Salary"]>70000)]
b

    YearsExperience    Salary
0               1.1   39343.0
2               1.5   37731.0
4               2.2   39891.0
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [49]:
b=a[a["Salary"].notna()]
b.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [50]:
b=a.loc[a["YearsExperience"]>2,"Salary"]
b.head()

4    39891.0
5    56642.0
6    60150.0
7    54445.0
8    64445.0
Name: Salary, dtype: float64

In [51]:
a.iloc[10:20,0:1]

    YearsExperience
10              3.9
11              4.0
12              4.0
13              4.1
14              4.5
15              4.9
16              5.1
17              5.3
18              5.9
19              6.0

In [53]:
a.iloc[0:3,1]=0
a

    YearsExperience    Salary
0               1.1       0.0
1               1.3       0.0
2               1.5       0.0
3               2.0   43525.0
4               2.2   39891.0
5               2.9   56642.0
6               3.0   60150.0
7               3.2   54445.0
8               3.2   64445.0
9               3.7   57189.0
10              3.9   63218.0
11              4.0   55794.0
12              4.0   56957.0
13              4.1   57081.0
14              4.5   61111.0
15              4.9   67938.0
16              5.1   66029.0
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [ ]:
a=pd.read_csv("")